Repository: AlexFrick92/PNTZ.Mufta
Catalog: Promatis.Core/Resources/Localization.*.resx
Languages: ru_ru

# AppDomainHelper_AppDomainUnableUnload
source: App domain "{0}" can't be unloaded
ru_ru: Домен приложения "{0}" не может быть выгружен

# AppDomainHelper_AppDomainUnloaded
source: App domain "{0}" unloaded
ru_ru: Домен приложения "{0}" выгружен

# AppDomainHelper_AppDomainUnloadError
source: Errors occurred while unloading the app domain "{0}"
ru_ru: При выгрузке домена приложения "{0}" возникла ошибка

# CommandLine_ArgumentNotFound
source: Argument "{0}" is not found in arguments type
ru_ru: Аргумент"{0}" не определен в типе аргументов

# CommandLine_DuplicateArgument
source: Argument "{0}" is duplicated
ru_ru: Дублирование аргумента "{0}"

# CommandLine_InvalidPositionsSequence
source: Wrong position "{1}" on argument "{0}"
ru_ru: Нарушена последовательность позиций для аргумента "{0}" при описании типа аргументов

# CommandLine_PressAnyKey
source: Press any key for continue
ru_ru: Для продолжения нажмите любую клавишу

# CommandLine_RequiredArgumentIsNotSet
source: Argument "{0}" is required, but it doesn't have value
ru_ru: Не задано значение для обязательного аргумента "{0}"

# Guard_InstanceNotImplementInterface
source: The instance "{0}" is not implements interface type "{1}"
ru_ru: Экземпляр "{0}" не реализует интерфейс "{1}"

# Guard_InstanceNotInheritedOfType
source: The instance "{0}" is not directly inherited from type "{1}"
ru_ru: Экземпляр "{0}" не унаследован напрямую от типа "{1}"

# Guard_InstanceNotOfType
source: Type instance "{0}" is not equal "{1}"
ru_ru: Тип экземпляра "{0}" не является типом "{1}"

# Guard_InstanceNotSubclassOfType
source: The instance "{0}" is not subclass of type "{1}"
ru_ru: Экземпляр "{0}" не унаследован от типа "{1}"

# Guard_TypeNotImplementInterface
source: The type "{0}" is not implements interface type "{1}"
ru_ru: Тип "{0}" не реализует интерфейс "{1}"

# Guard_TypeNotInheritedOfType
source: The type "{0}" is not directly inherited from type "{1}"
ru_ru: Тип "{0}" не унаследован напрямую от типа "{1}"

# Guard_ValueCantBeEmpty
source: SetValue of "{0}" can't be empty
ru_ru: Значение "{0}" не может быть пустым

# Guard_ValueCantBeUndefined
source: SetValue of "{0}" can't be undefined
ru_ru: Значение "{0}" не может быть неопределенным (null)

# AssemblyHelper_AssemblyNotLoaded
source: Assembly "{0}" was not loaded
ru_ru: Невозможно загрузить сборку "{0}"

# StringExtensions_WrongEncryptedData
source: Wrong format of encripted data
ru_ru: Неправильный формат зашифрованных данных

# OperationResult_FailMessage
source: Operation fail.
ru_ru: Операция не выполнена.

# OperationResult_SuccessMessage
source: Operation success.
ru_ru: Операция выполнена.

source: You must define error message
ru_ru: Необходимо указать сообщение об ошибке

# IocContext_ContextIsNotInitialized
source: IoC ccontext is not initialized. Call Initialize method before.
ru_ru: Ioc контекст не инициализирован. Необходимо вызвать метод Initialize.

# IocContext_ContextAlreadyInitialized
source: IoC context already initialized.
ru_ru: Ioc контекст уже инициализирован.
